MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX775F256H.atdf
         <register caption="Ethernet Controller MAC Collision Window/Retry Limit Register" name="EMAC1CLRT" offset="0x240" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RETX" />
            <bitfield mask="0x00003F00" name="CWINDOW" />
         </register>
         <register caption="Ethernet Controller MAC Maximum Frame Length Register" name="EMAC1MAXF" offset="0x250" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="MACMAXF" />
         </register>
         <register caption="Ethernet Controller MAC PHY Support Register" name="EMAC1SUPP" offset="0x260" rw="RW" size="4">
            <bitfield caption="RMII Speed bit" mask="0x00000100" name="SPEEDRMII" values="EMAC1SUPP__SPEEDRMII" />
            <bitfield caption="Reset RMII Logic bit" mask="0x00000800" name="RESETRMII" values="EMAC1SUPP__RESETRMII" />
         </register>
         <register caption="Ethernet Controller MAC Test Register" name="EMAC1TEST" offset="0x270" rw="RW" size="4">
            <bitfield caption="Shortcut PAUSE Quanta bit" mask="0x00000001" name="SHRTQNTA" values="EMAC1TEST__SHRTQNTA" />
            <bitfield caption="Test PAUSE bit" mask="0x00000002" name="TESTPAUSE" values="EMAC1TEST__TESTPAUSE" />
            <bitfield caption="Test Backpressure bit" mask="0x00000004" name="TESTBP" values="EMAC1TEST__TESTBP" />
         </register>
         <register caption="Ethernet Controller MAC MII Management Configuration Register" name="EMAC1MCFG" offset="0x280" rw="RW" size="4">
            <bitfield caption="Scan Increment bit" mask="0x00000001" name="SCANINC" values="EMAC1MCFG__SCANINC" />
            <bitfield caption="Suppress Preamble bit" mask="0x00000002" name="NOPRE" values="EMAC1MCFG__NOPRE" />
            <bitfield mask="0x0000003C" name="CLKSEL" />
            <bitfield caption="Test Reset MII Management bit" mask="0x00008000" name="RESETMGMT" values="EMAC1MCFG__RESETMGMT" />
         </register>
         <register caption="Ethernet Controller MAC MII Management Command Register" name="EMAC1MCMD" offset="0x290" rw="RW" size="4">
            <bitfield caption="MII Management Read Command bit" mask="0x00000001" name="READ" values="EMAC1MCMD__READ" />
            <bitfield caption="MII Management Scan Mode bit" mask="0x00000002" name="SCAN" values="EMAC1MCMD__SCAN" />
         </register>
         <register caption="Ethernet Controller MAC MII Management Address Register" name="EMAC1MADR" offset="0x2a0" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="REGADDR" />
            <bitfield mask="0x00001F00" name="PHYADDR" />
         </register>
         <register caption="Ethernet Controller MAC MII Management Write Data Register" name="EMAC1MWTD" offset="0x2b0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="MWTD" />
         </register>
         <register caption="Ethernet Controller MAC MII Management Read Data Register" name="EMAC1MRDD" offset="0x2c0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="MRDD" />
         </register>
         <register caption="Ethernet Controller MAC MII Management Indicators Register" name="EMAC1MIND" offset="0x2d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="MIIMBUSY" />
            <bitfield mask="0x00000002" name="SCAN" />
            <bitfield mask="0x00000004" name="NOTVALID" />
            <bitfield mask="0x00000008" name="LINKFAIL" />
         </register>
         <register caption="Ethernet Controller MAC Station Address 0 Register" name="EMAC1SA0" offset="0x300" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="STNADDR5" />
            <bitfield mask="0x0000FF00" name="STNADDR6" />
         </register>
         <register caption="Ethernet Controller MAC Station Address 1 Register" name="EMAC1SA1" offset="0x310" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="STNADDR3" />
            <bitfield mask="0x0000FF00" name="STNADDR4" />
         </register>
         <register caption="Ethernet Controller MAC Station Address 2 Register" name="EMAC1SA2" offset="0x320" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="STNADDR1" />
            <bitfield mask="0x0000FF00" name="STNADDR2" />
         </register>
      </register-group>
      <value-group caption="Manual Flow Control bit" name="ETHCON1__MANFC">
         <value caption="Manual Flow Control is enabled" name="" value="0x1" />
         <value caption="Manual Flow Control is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Automatic Flow Control bit" name="ETHCON1__AUTOFC">
         <value caption="Automatic Flow Control enabled" name="" value="0x1" />
         <value caption="Automatic Flow Control disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Enable bit" name="ETHCON1__RXEN">
         <value caption="Enable RX logic" name="" value="0x1" />
         <value caption="Disable RX logic" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Request to Send bit" name="ETHCON1__TXRTS">
         <value caption="Activate the TX logic and send the packet(s) defined in the TX EDT" name="" value="0x1" />
         <value caption="Stop transmit (when cleared by software) or transmit done (when cleared by hardware)" name="" value="0x0" />
      </value-group>
      <value-group caption="Ethernet Stop in Idle Mode bit" name="ETHCON1__SIDL">
         <value caption="Ethernet module transfers are paused during Idle mode" name="" value="0x1" />
         <value caption="Ethernet module transfers continue during Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Ethernet ON bit" name="ETHCON1__ON">
         <value caption="Ethernet module is enabled" name="" value="0x1" />
         <value caption="Ethernet module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="RX Data Buffer Size for All RX Descriptors bits" name="ETHCON2__RXBUFSZ">
         <value caption="RX data Buffer size for descriptors is 2032 bytes" name="" value="0x7f" />
         <value caption="RX data Buffer size for descriptors is 1536 bytes" name="" value="0x60" />
         <value caption="RX data Buffer size for descriptors is 48 bytes" name="" value="0x3" />
         <value caption="RX data Buffer size for descriptors is 32 bytes" name="" value="0x2" />
         <value caption="RX data Buffer size for descriptors is 16 bytes" name="" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
