MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX775F256H.atdf
      <value-group caption="Packet Pending Interrupt Enable bit" name="ETHIEN__PKTPENDIE">
         <value caption="Enable PKTPEND Interrupt" name="" value="0x1" />
         <value caption="Disable PKTPEND Interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="Receiver Done Interrupt Enable bit" name="ETHIEN__RXDONEIE">
         <value caption="Enable RXDONE Interrupt" name="" value="0x1" />
         <value caption="Disable RXDONE Interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="Full Watermark Interrupt Enable bit" name="ETHIEN__FWMARKIE">
         <value caption="Enable FWMARK Interrupt" name="" value="0x1" />
         <value caption="Disable FWMARK Interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="Empty Watermark Interrupt Enable bit" name="ETHIEN__EWMARKIE">
         <value caption="Enable EWMARK Interrupt" name="" value="0x1" />
         <value caption="Disable EWMARK Interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive BVCI Bus Error Interrupt Enable bit" name="ETHIEN__RXBUSEIE">
         <value caption="Enable RXBUS Error Interrupt" name="" value="0x1" />
         <value caption="Disable RXBUS Error Interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit BVCI Bus Error Interrupt Enable bit" name="ETHIEN__TXBUSEIE">
         <value caption="Enable TXBUS Error Interrupt" name="" value="0x1" />
         <value caption="Disable TXBUS Error Interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive FIFO Over Flow Error bit" name="ETHIRQ__RXOVFLW">
         <value caption="RX FIFO Overflow Error condition has occurred" name="" value="0x1" />
         <value caption="No interrupt pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Not Available Interrupt bit" name="ETHIRQ__RXBUFNA">
         <value caption="RX Buffer Descriptor Not Available condition has occurred" name="" value="0x1" />
         <value caption="No interrupt pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Abort Condition Interrupt bit" name="ETHIRQ__TXABORT">
         <value caption="TX abort condition occurred on the last TX packet" name="" value="0x1" />
         <value caption="No interrupt pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Done Interrupt bit" name="ETHIRQ__TXDONE">
         <value caption="TX packet was successfully sent" name="" value="0x1" />
         <value caption="No interrupt pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Activity Interrupt bit" name="ETHIRQ__RXACT">
         <value caption="RX packet data was successfully received" name="" value="0x1" />
         <value caption="No interrupt pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Packet Pending Interrupt bit" name="ETHIRQ__PKTPEND">
         <value caption="RX packet pending in memory" name="" value="0x1" />
         <value caption="RX packet is not pending in memory" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Done Interrupt bit" name="ETHIRQ__RXDONE">
         <value caption="RX packet was successfully received" name="" value="0x1" />
         <value caption="No interrupt pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Full Watermark Interrupt bit" name="ETHIRQ__FWMARK">
         <value caption="Full Watermark pointer reached" name="" value="0x1" />
         <value caption="No interrupt pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Empty Watermark Interrupt bit" name="ETHIRQ__EWMARK">
         <value caption="Empty Watermark pointer reached" name="" value="0x1" />
         <value caption="No interrupt pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive BVCI Bus Error Interrupt bit" name="ETHIRQ__RXBUSE">
         <value caption="BVCI Bus Error has occurred" name="" value="0x1" />
         <value caption="BVCI Bus Error has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit BVCI Bus Error Interrupt bit" name="ETHIRQ__TXBUSE">
         <value caption="BVCI Bus Error has occurred" name="" value="0x1" />
         <value caption="BVCI Bus Error has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Busy bit" name="ETHSTAT__RXBUSY">
         <value caption="RX logic is receiving data" name="" value="0x1" />
         <value caption="RX logic is idle" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Busy bit" name="ETHSTAT__TXBUSY">
         <value caption="TX logic is receiving data" name="" value="0x1" />
         <value caption="TX logic is idle" name="" value="0x0" />
      </value-group>
      <value-group caption="Ethernet Module busy bit" name="ETHSTAT__ETHBUSY">
         <value caption="Ethernet logic has been turned on (ON (ETHCON1) = 1) or is completing a transaction" name="" value="0x80" />
         <value caption="Ethernet logic is idle" name="" value="0x0" />
      </value-group>
      <value-group caption="MAC Receive Enable bit" name="EMAC1CFG1__RXENABLE">
         <value caption="Enable the MAC receiving of frames" name="" value="0x1" />
         <value caption="Disable the MAC receiving of frames" name="" value="0x0" />
      </value-group>
      <value-group caption="MAC Pass all Receive Frames bit" name="EMAC1CFG1__PASSALL">
         <value caption="The MAC will accept all frames regardless of type (Normal vs. Control)" name="" value="0x1" />
         <value caption="The received Control frames are ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="MAC RX Flow Control bit" name="EMAC1CFG1__RXPAUSE">
         <value caption="The MAC acts upon received PAUSE Flow Control frames" name="" value="0x1" />
         <value caption="Received PAUSE Flow Control frames are ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="MAC TX Flow Control bit" name="EMAC1CFG1__TXPAUSE">
         <value caption="PAUSE Flow Control frames are allowed to be transmitted" name="" value="0x1" />
         <value caption="PAUSE Flow Control frames are blocked" name="" value="0x0" />
      </value-group>
      <value-group caption="MAC Loopback mode bit" name="EMAC1CFG1__LOOPBACK">
         <value caption="MAC Transmit interface is loop backed to the MAC Receive interface" name="" value="0x1" />
         <value caption="MAC normal operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Full-Duplex Operation bit" name="EMAC1CFG2__FULLDPLX">
         <value caption="The MAC operates in Full-Duplex mode" name="" value="0x1" />
         <value caption="The MAC operates in Half-Duplex mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Frame Length checking bit" name="EMAC1CFG2__LENGTHCK">
         <value caption="Both transmit and receive frame lengths are compared to the Length/Type field. If the Length/Type field represents a length then the check is performed. Mismatches are reported on the transmit/receive statistics vector." name="" value="0x1" />
         <value caption="Length/Type field check is not performed" name="" value="0x0" />
      </value-group>
