MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX775F256H.atdf
      <value-group caption="Alarm Mask Configuration bits" name="RTCALRM__AMASK">
         <value caption="Every half-second" name="" value="0x0" />
         <value caption="Every second" name="" value="0x1" />
         <value caption="Every 10 seconds" name="" value="0x2" />
         <value caption="Every minute" name="" value="0x3" />
         <value caption="Every 10 minutes" name="" value="0x4" />
         <value caption="Every hour" name="" value="0x5" />
         <value caption="Once a day" name="" value="0x6" />
         <value caption="Once a week" name="" value="0x7" />
         <value caption="Once a month" name="" value="0x8" />
         <value caption="Once a year (except when configured for February 29" name="" value="0x9" />
         <value caption="Reserved; do not use" name="" value="0xa" />
         <value caption="Reserved; do not use" name="" value="0xb" />
         <value caption="Reserved; do not use" name="" value="0xc" />
         <value caption="Reserved; do not use" name="" value="0xd" />
         <value caption="Reserved; do not use" name="" value="0xe" />
         <value caption="Reserved; do not use" name="" value="0xf" />
      </value-group>
      <value-group caption="Alarm Sync bit" name="RTCALRM__ALRMSYNC">
         <value caption="ARPT(7:0) and ALRMEN may change as a result of a half second rollover during a read." name="" value="0x1" />
         <value caption="ARPT(7:0) and ALRMEN can be read without concerns of rollover because the prescaler is more than 32 RTC clocks away from a half-second rollover" name="" value="0x0" />
      </value-group>
      <value-group caption="Alarm Pulse Initial Value bit" name="RTCALRM__PIV">
         <value caption="(When ALRMEN = 0) Alarm pulse high / (When ALRMEN = 1) PIV is read-only and returns state of the alarm pulse." name="" value="0x1" />
         <value caption="(When ALRMEN = 0) Alarm pulse low / (When ALRMEN = 1) PIV is read-only and returns state of the alarm pulse." name="" value="0x0" />
      </value-group>
      <value-group caption="Chime Enable bit" name="RTCALRM__CHIME">
         <value caption="Chime is enabled ARPT(7:0) is allowed to rollover from 0x00 to 0xFF" name="" value="0x1" />
         <value caption="Chime is disabled ARPT(7:0) stops once it reaches 0x00" name="" value="0x0" />
      </value-group>
      <value-group caption="Alarm Enable bit" name="RTCALRM__ALRMEN">
         <value caption="Alarm is enabled" name="" value="0x1" />
         <value caption="Alarm is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00753" name="SPI" version="1">
      <register-group name="SPI">
         <register caption="SPI Control Register" name="SPI3CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Interrupt Mode bits" mask="0x00000003" name="SRXISEL" values="SPI3CON__SRXISEL" />
            <bitfield caption="SPI Transmit Buffer Empty Interrupt Mode bits" mask="0x0000000C" name="STXISEL" values="SPI3CON__STXISEL" />
            <bitfield caption="Master Mode Enable bit" mask="0x00000020" name="MSTEN" values="SPI3CON__MSTEN" />
            <bitfield caption="Clock Polarity Select bit" mask="0x00000040" name="CKP" values="SPI3CON__CKP" />
            <bitfield caption="Slave Select Enable bit" mask="0x00000080" name="SSEN" values="SPI3CON__SSEN" />
            <bitfield caption="SPI Clock Edge Select bit" mask="0x00000100" name="CKE" values="SPI3CON__CKE" />
            <bitfield caption="SPI Data Input Sample Phase bit (master mode only)" mask="0x00000200" name="SMP" values="SPI3CON__SMP" />
            <bitfield caption="32/16-Bit Communication Select bits" mask="0x00000C00" name="MODE32" values="SPI3CON__MODE32" />
            <bitfield caption="Disable SDOx pin bit" mask="0x00001000" name="DISSDO" values="SPI3CON__DISSDO" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="SPI3CON__SIDL" />
            <bitfield caption="SPI Peripheral On bit" mask="0x00008000" name="ON" values="SPI3CON__ON" />
            <bitfield caption="Enhanced Buffer Enable bit" mask="0x00010000" name="ENHBUF" values="SPI3CON__ENHBUF" />
            <bitfield caption="Frame Sync Pulse Edge Select bit" mask="0x00020000" name="SPIFE" values="SPI3CON__SPIFE" />
            <bitfield caption="Frame Sync Pulse Counter bits. Controls the number of data characters transmitted per pulse. This bit is only valid in FRAMED_SYNC mode." mask="0x07000000" name="FRMCNT" values="SPI3CON__FRMCNT" />
            <bitfield caption="Frame Sync Pulse Width bit" mask="0x08000000" name="FRMSYPW" values="SPI3CON__FRMSYPW" />
            <bitfield caption="Master Mode Slave Select Enable bit" mask="0x10000000" name="MSSEN" values="SPI3CON__MSSEN" />
            <bitfield caption="Frame Sync Polarity bit (Framed SPI mode only)" mask="0x20000000" name="FRMPOL" values="SPI3CON__FRMPOL" />
            <bitfield caption="Frame Sync Pulse Direction Control on SSx pin bit (Framed SPI mode only)" mask="0x40000000" name="FRMSYNC" values="SPI3CON__FRMSYNC" />
            <bitfield caption="Framed SPI Support bit" mask="0x80000000" name="FRMEN" values="SPI3CON__FRMEN" />
         </register>
         <register caption="SPI Control Register" name="SPI2CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Interrupt Mode bits" mask="0x00000003" name="SRXISEL" values="SPI2CON__SRXISEL" />
            <bitfield caption="SPI Transmit Buffer Empty Interrupt Mode bits" mask="0x0000000C" name="STXISEL" values="SPI2CON__STXISEL" />
            <bitfield caption="Master Mode Enable bit" mask="0x00000020" name="MSTEN" values="SPI2CON__MSTEN" />
            <bitfield caption="Clock Polarity Select bit" mask="0x00000040" name="CKP" values="SPI2CON__CKP" />
            <bitfield caption="Slave Select Enable bit" mask="0x00000080" name="SSEN" values="SPI2CON__SSEN" />
            <bitfield caption="SPI Clock Edge Select bit" mask="0x00000100" name="CKE" values="SPI2CON__CKE" />
            <bitfield caption="SPI Data Input Sample Phase bit (master mode only)" mask="0x00000200" name="SMP" values="SPI2CON__SMP" />
            <bitfield caption="32/16-Bit Communication Select bits" mask="0x00000C00" name="MODE32" values="SPI2CON__MODE32" />
            <bitfield caption="Disable SDOx pin bit" mask="0x00001000" name="DISSDO" values="SPI2CON__DISSDO" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="SPI2CON__SIDL" />
            <bitfield caption="SPI Peripheral On bit" mask="0x00008000" name="ON" values="SPI2CON__ON" />
            <bitfield caption="Enhanced Buffer Enable bit" mask="0x00010000" name="ENHBUF" values="SPI2CON__ENHBUF" />
            <bitfield caption="Frame Sync Pulse Edge Select bit" mask="0x00020000" name="SPIFE" values="SPI2CON__SPIFE" />
            <bitfield caption="Frame Sync Pulse Counter bits. Controls the number of data characters transmitted per pulse. This bit is only valid in FRAMED_SYNC mode." mask="0x07000000" name="FRMCNT" values="SPI2CON__FRMCNT" />
            <bitfield caption="Frame Sync Pulse Width bit" mask="0x08000000" name="FRMSYPW" values="SPI2CON__FRMSYPW" />
            <bitfield caption="Master Mode Slave Select Enable bit" mask="0x10000000" name="MSSEN" values="SPI2CON__MSSEN" />
            <bitfield caption="Frame Sync Polarity bit (Framed SPI mode only)" mask="0x20000000" name="FRMPOL" values="SPI2CON__FRMPOL" />
            <bitfield caption="Frame Sync Pulse Direction Control on SSx pin bit (Framed SPI mode only)" mask="0x40000000" name="FRMSYNC" values="SPI2CON__FRMSYNC" />
            <bitfield caption="Framed SPI Support bit" mask="0x80000000" name="FRMEN" values="SPI2CON__FRMEN" />
         </register>
         <register caption="SPI Control Register" name="SPI4CON" offset="0x400" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Interrupt Mode bits" mask="0x00000003" name="SRXISEL" values="SPI4CON__SRXISEL" />
            <bitfield caption="SPI Transmit Buffer Empty Interrupt Mode bits" mask="0x0000000C" name="STXISEL" values="SPI4CON__STXISEL" />
            <bitfield caption="Master Mode Enable bit" mask="0x00000020" name="MSTEN" values="SPI4CON__MSTEN" />
            <bitfield caption="Clock Polarity Select bit" mask="0x00000040" name="CKP" values="SPI4CON__CKP" />
            <bitfield caption="Slave Select Enable bit" mask="0x00000080" name="SSEN" values="SPI4CON__SSEN" />
            <bitfield caption="SPI Clock Edge Select bit" mask="0x00000100" name="CKE" values="SPI4CON__CKE" />
            <bitfield caption="SPI Data Input Sample Phase bit (master mode only)" mask="0x00000200" name="SMP" values="SPI4CON__SMP" />
            <bitfield caption="32/16-Bit Communication Select bits" mask="0x00000C00" name="MODE32" values="SPI4CON__MODE32" />
            <bitfield caption="Disable SDOx pin bit" mask="0x00001000" name="DISSDO" values="SPI4CON__DISSDO" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="SPI4CON__SIDL" />
            <bitfield caption="SPI Peripheral On bit" mask="0x00008000" name="ON" values="SPI4CON__ON" />
            <bitfield caption="Enhanced Buffer Enable bit" mask="0x00010000" name="ENHBUF" values="SPI4CON__ENHBUF" />
            <bitfield caption="Frame Sync Pulse Edge Select bit" mask="0x00020000" name="SPIFE" values="SPI4CON__SPIFE" />
            <bitfield caption="Frame Sync Pulse Counter bits. Controls the number of data characters transmitted per pulse. This bit is only valid in FRAMED_SYNC mode." mask="0x07000000" name="FRMCNT" values="SPI4CON__FRMCNT" />
            <bitfield caption="Frame Sync Pulse Width bit" mask="0x08000000" name="FRMSYPW" values="SPI4CON__FRMSYPW" />
            <bitfield caption="Master Mode Slave Select Enable bit" mask="0x10000000" name="MSSEN" values="SPI4CON__MSSEN" />
            <bitfield caption="Frame Sync Polarity bit (Framed SPI mode only)" mask="0x20000000" name="FRMPOL" values="SPI4CON__FRMPOL" />
            <bitfield caption="Frame Sync Pulse Direction Control on SSx pin bit (Framed SPI mode only)" mask="0x40000000" name="FRMSYNC" values="SPI4CON__FRMSYNC" />
            <bitfield caption="Framed SPI Support bit" mask="0x80000000" name="FRMEN" values="SPI4CON__FRMEN" />
         </register>
         <register caption="" name="SPI3STAT" offset="0x10" rw="R" size="4">
            <bitfield caption="SPI Receive Buffer Full Status bit" mask="0x00000001" name="SPIRBF" values="SPI3STAT__SPIRBF" />
            <bitfield caption="SPI Transmit Buffer Full Status bit" mask="0x00000002" name="SPITBF" values="SPI3STAT__SPITBF" />
            <bitfield caption="SPI Transmit Buffer Empty Status bit" mask="0x00000008" name="SPITBE" values="SPI3STAT__SPITBE" />
            <bitfield caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" mask="0x00000020" name="SPIRBE" values="SPI3STAT__SPIRBE" />
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="SPIROV" values="SPI3STAT__SPIROV" />
            <bitfield caption="Shift Register Empty bit (valid only when ENHBUF = 1)" mask="0x00000080" name="SRMT" values="SPI3STAT__SRMT" />
            <bitfield caption="Transmit Under Run bit" mask="0x00000100" name="SPITUR" values="SPI3STAT__SPITUR" />
            <bitfield caption="SPI Activity Status bit" mask="0x00000800" name="SPIBUSY" values="SPI3STAT__SPIBUSY" />
            <bitfield mask="0x001F0000" name="TXBUFELM" />
            <bitfield mask="0x1F000000" name="RXBUFELM" />
         </register>
