MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX775F256H.atdf
         <register caption="UARTx Status and Control Register" name="U4STA" offset="0x210" rw="RW" size="4">
            <bitfield caption="Receive Buffer Data Available bit (read-only)" mask="0x00000001" name="URXDA" values="U4STA__URXDA" />
            <bitfield caption="Receive Buffer Overrun Error Status bit." mask="0x00000002" name="OERR" values="U4STA__OERR" />
            <bitfield caption="Framing Error Status bit" mask="0x00000004" name="FERR" values="U4STA__FERR" />
            <bitfield caption="Parity Error Status bit" mask="0x00000008" name="PERR" values="U4STA__PERR" />
            <bitfield caption="Receiver Idle bit" mask="0x00000010" name="RIDLE" values="U4STA__RIDLE" />
            <bitfield caption="Address Character Detect bit" mask="0x00000020" name="ADDEN" values="U4STA__ADDEN" />
            <bitfield caption="Receive Interrupt Mode Selection bit" mask="0x000000C0" name="URXISEL" values="U4STA__URXISEL" />
            <bitfield caption="Transmit Shift Register is Empty bit (read-only)" mask="0x00000100" name="TRMT" values="U4STA__TRMT" />
            <bitfield caption="Transmit Buffer Full Status bit (read-only)" mask="0x00000200" name="UTXBF" values="U4STA__UTXBF" />
            <bitfield caption="Transmit Enable bit" mask="0x00000400" name="UTXEN" values="U4STA__UTXEN" />
            <bitfield caption="Transmit Break bit" mask="0x00000800" name="UTXBRK" values="U4STA__UTXBRK" />
            <bitfield caption="Receiver Enable bit" mask="0x00001000" name="URXEN" values="U4STA__URXEN" />
            <bitfield caption="Transmit Polarity Inversion bit" mask="0x00002000" name="UTXINV" values="U4STA__UTXINV" />
            <bitfield caption="TX Interrupt Mode Selection bits" mask="0x0000C000" name="UTXISEL" values="U4STA__UTXISEL" />
            <bitfield mask="0x00FF0000" name="ADDR" />
            <bitfield caption="Automatic Address Detect Mode Enable bit" mask="0x01000000" name="ADM_EN" values="U4STA__ADM_EN" />
         </register>
         <register caption="UARTx Status and Control Register" name="U3STA" offset="0x410" rw="RW" size="4">
            <bitfield caption="Receive Buffer Data Available bit (read-only)" mask="0x00000001" name="URXDA" values="U3STA__URXDA" />
            <bitfield caption="Receive Buffer Overrun Error Status bit." mask="0x00000002" name="OERR" values="U3STA__OERR" />
            <bitfield caption="Framing Error Status bit" mask="0x00000004" name="FERR" values="U3STA__FERR" />
            <bitfield caption="Parity Error Status bit" mask="0x00000008" name="PERR" values="U3STA__PERR" />
            <bitfield caption="Receiver Idle bit" mask="0x00000010" name="RIDLE" values="U3STA__RIDLE" />
            <bitfield caption="Address Character Detect bit" mask="0x00000020" name="ADDEN" values="U3STA__ADDEN" />
            <bitfield caption="Receive Interrupt Mode Selection bit" mask="0x000000C0" name="URXISEL" values="U3STA__URXISEL" />
            <bitfield caption="Transmit Shift Register is Empty bit (read-only)" mask="0x00000100" name="TRMT" values="U3STA__TRMT" />
            <bitfield caption="Transmit Buffer Full Status bit (read-only)" mask="0x00000200" name="UTXBF" values="U3STA__UTXBF" />
            <bitfield caption="Transmit Enable bit" mask="0x00000400" name="UTXEN" values="U3STA__UTXEN" />
            <bitfield caption="Transmit Break bit" mask="0x00000800" name="UTXBRK" values="U3STA__UTXBRK" />
            <bitfield caption="Receiver Enable bit" mask="0x00001000" name="URXEN" values="U3STA__URXEN" />
            <bitfield caption="Transmit Polarity Inversion bit" mask="0x00002000" name="UTXINV" values="U3STA__UTXINV" />
            <bitfield caption="TX Interrupt Mode Selection bits" mask="0x0000C000" name="UTXISEL" values="U3STA__UTXISEL" />
            <bitfield mask="0x00FF0000" name="ADDR" />
            <bitfield caption="Automatic Address Detect Mode Enable bit" mask="0x01000000" name="ADM_EN" values="U3STA__ADM_EN" />
         </register>
         <register caption="UARTx Status and Control Register" name="U6STA" offset="0x610" rw="RW" size="4">
            <bitfield caption="Receive Buffer Data Available bit (read-only)" mask="0x00000001" name="URXDA" values="U6STA__URXDA" />
            <bitfield caption="Receive Buffer Overrun Error Status bit." mask="0x00000002" name="OERR" values="U6STA__OERR" />
            <bitfield caption="Framing Error Status bit" mask="0x00000004" name="FERR" values="U6STA__FERR" />
            <bitfield caption="Parity Error Status bit" mask="0x00000008" name="PERR" values="U6STA__PERR" />
            <bitfield caption="Receiver Idle bit" mask="0x00000010" name="RIDLE" values="U6STA__RIDLE" />
            <bitfield caption="Address Character Detect bit" mask="0x00000020" name="ADDEN" values="U6STA__ADDEN" />
            <bitfield caption="Receive Interrupt Mode Selection bit" mask="0x000000C0" name="URXISEL" values="U6STA__URXISEL" />
            <bitfield caption="Transmit Shift Register is Empty bit (read-only)" mask="0x00000100" name="TRMT" values="U6STA__TRMT" />
            <bitfield caption="Transmit Buffer Full Status bit (read-only)" mask="0x00000200" name="UTXBF" values="U6STA__UTXBF" />
            <bitfield caption="Transmit Enable bit" mask="0x00000400" name="UTXEN" values="U6STA__UTXEN" />
            <bitfield caption="Transmit Break bit" mask="0x00000800" name="UTXBRK" values="U6STA__UTXBRK" />
            <bitfield caption="Receiver Enable bit" mask="0x00001000" name="URXEN" values="U6STA__URXEN" />
            <bitfield caption="Transmit Polarity Inversion bit" mask="0x00002000" name="UTXINV" values="U6STA__UTXINV" />
            <bitfield caption="TX Interrupt Mode Selection bits" mask="0x0000C000" name="UTXISEL" values="U6STA__UTXISEL" />
            <bitfield mask="0x00FF0000" name="ADDR" />
            <bitfield caption="Automatic Address Detect Mode Enable bit" mask="0x01000000" name="ADM_EN" values="U6STA__ADM_EN" />
         </register>
         <register caption="UARTx Status and Control Register" name="U2STA" offset="0x810" rw="RW" size="4">
            <bitfield caption="Receive Buffer Data Available bit (read-only)" mask="0x00000001" name="URXDA" values="U2STA__URXDA" />
            <bitfield caption="Receive Buffer Overrun Error Status bit." mask="0x00000002" name="OERR" values="U2STA__OERR" />
            <bitfield caption="Framing Error Status bit" mask="0x00000004" name="FERR" values="U2STA__FERR" />
            <bitfield caption="Parity Error Status bit" mask="0x00000008" name="PERR" values="U2STA__PERR" />
            <bitfield caption="Receiver Idle bit" mask="0x00000010" name="RIDLE" values="U2STA__RIDLE" />
            <bitfield caption="Address Character Detect bit" mask="0x00000020" name="ADDEN" values="U2STA__ADDEN" />
            <bitfield caption="Receive Interrupt Mode Selection bit" mask="0x000000C0" name="URXISEL" values="U2STA__URXISEL" />
            <bitfield caption="Transmit Shift Register is Empty bit (read-only)" mask="0x00000100" name="TRMT" values="U2STA__TRMT" />
            <bitfield caption="Transmit Buffer Full Status bit (read-only)" mask="0x00000200" name="UTXBF" values="U2STA__UTXBF" />
            <bitfield caption="Transmit Enable bit" mask="0x00000400" name="UTXEN" values="U2STA__UTXEN" />
            <bitfield caption="Transmit Break bit" mask="0x00000800" name="UTXBRK" values="U2STA__UTXBRK" />
            <bitfield caption="Receiver Enable bit" mask="0x00001000" name="URXEN" values="U2STA__URXEN" />
            <bitfield caption="Transmit Polarity Inversion bit" mask="0x00002000" name="UTXINV" values="U2STA__UTXINV" />
            <bitfield caption="TX Interrupt Mode Selection bits" mask="0x0000C000" name="UTXISEL" values="U2STA__UTXISEL" />
            <bitfield mask="0x00FF0000" name="ADDR" />
            <bitfield caption="Automatic Address Detect Mode Enable bit" mask="0x01000000" name="ADM_EN" values="U2STA__ADM_EN" />
         </register>
